Tekla Open API Reference for Tekla Structures 2025
AngleDimension Properties
The AngleDimension type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the angle dimension attributes.
Distance
 Gets or sets the distance (from the origin to the second point's direction). The distance is measured in paper millimeters.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from DimensionBase.)
Origin
 Gets or sets the origin of the dimension.
Point1
 Gets or sets the first point.
Point2
 Gets or sets the second point.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace